Словарь/src/DataProcessors/ЗаполнениеАзбук/ЗаполнениеАзбук.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполнениеАзбук</name>
</mdclass:DataProcessor>

Словарь/src/InformationRegisters/Катакана/Катакана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Катакана</name>
  <resources>
    <name>НаименованиеНаРусском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Юникод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЮникодПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Моджи</name>
    <type>
      <types>CatalogRef.Моджи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Словарь/src/InformationRegisters/Хирагана/Хирагана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Хирагана</name>
  <resources>
    <name>НаименованиеНаРусском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Юникод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЮникодПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Моджи</name>
    <type>
      <types>CatalogRef.Моджи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Словарь/src/Catalogs/Моджи/Моджи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Моджи</name>
  <comment>1 символ</comment>
  <predefined>
    <items>
      <name>A</name>
      <description>A</description>
    </items>
    <items>
      <name>Ba</name>
      <description>Ba</description>
    </items>
    <items>
      <name>Be</name>
      <description>Be</description>
    </items>
    <items>
      <name>Bi</name>
      <description>Bi</description>
    </items>
    <items>
      <name>Bo</name>
      <description>Bo</description>
    </items>
    <items>
      <name>Bu</name>
      <description>Bu</description>
    </items>
    <items>
      <name>Chi</name>
      <description>Chi</description>
    </items>
    <items>
      <name>Da</name>
      <description>Da</description>
    </items>
    <items>
      <name>De</name>
      <description>De</description>
    </items>
    <items>
      <name>Do</name>
      <description>Do</description>
    </items>
    <items>
      <name>Dzu</name>
      <description>Dzu</description>
    </items>
    <items>
      <name>E</name>
      <description>E</description>
    </items>
    <items>
      <name>Fu</name>
      <description>Fu</description>
    </items>
    <items>
      <name>Ga</name>
      <description>Ga</description>
    </items>
    <items>
      <name>Ge</name>
      <description>Ge</description>
    </items>
    <items>
      <name>Gi</name>
      <description>Gi</description>
    </items>
    <items>
      <name>Go</name>
      <description>Go</description>
    </items>
    <items>
      <name>Gu</name>
      <description>Gu</description>
    </items>
    <items>
      <name>Ha</name>
      <description>Ha</description>
    </items>
    <items>
      <name>He</name>
      <description>He</description>
    </items>
    <items>
      <name>Hi</name>
      <description>Hi</description>
    </items>
    <items>
      <name>Ho</name>
      <description>Ho</description>
    </items>
    <items>
      <name>I</name>
      <description>I</description>
    </items>
    <items>
      <name>Dzi</name>
      <description>Ji</description>
    </items>
    <items>
      <name>Ji</name>
      <description>Ji</description>
    </items>
    <items>
      <name>Ka</name>
      <description>Ka</description>
    </items>
    <items>
      <name>Ke</name>
      <description>Ke</description>
    </items>
    <items>
      <name>Ki</name>
      <description>Ki</description>
    </items>
    <items>
      <name>Ko</name>
      <description>Ko</description>
    </items>
    <items>
      <name>Ku</name>
      <description>Ku</description>
    </items>
    <items>
      <name>Ma</name>
      <description>Ma</description>
    </items>
    <items>
      <name>Me</name>
      <description>Me</description>
    </items>
    <items>
      <name>Mi</name>
      <description>Mi</description>
    </items>
    <items>
      <name>Mo</name>
      <description>Mo</description>
    </items>
    <items>
      <name>Mu</name>
      <description>Mu</description>
    </items>
    <items>
      <name>N</name>
      <description>N</description>
    </items>
    <items>
      <name>Na</name>
      <description>Na</description>
    </items>
    <items>
      <name>Ne</name>
      <description>Ne</description>
    </items>
    <items>
      <name>Ni</name>
      <description>Ni</description>
    </items>
    <items>
      <name>No</name>
      <description>No</description>
    </items>
    <items>
      <name>Nu</name>
      <description>Nu</description>
    </items>
    <items>
      <name>O</name>
      <description>O</description>
    </items>
    <items>
      <name>Pa</name>
      <description>Pa</description>
    </items>
    <items>
      <name>Pe</name>
      <description>Pe</description>
    </items>
    <items>
      <name>Pi</name>
      <description>Pi</description>
    </items>
    <items>
      <name>Po</name>
      <description>Po</description>
    </items>
    <items>
      <name>Pu</name>
      <description>Pu</description>
    </items>
    <items>
      <name>Ra</name>
      <description>Ra</description>
    </items>
    <items>
      <name>Re</name>
      <description>Re</description>
    </items>
    <items>
      <name>Ri</name>
      <description>Ri</description>
    </items>
    <items>
      <name>Ro</name>
      <description>Ro</description>
    </items>
    <items>
      <name>Ru</name>
      <description>Ru</description>
    </items>
    <items>
      <name>Sa</name>
      <description>Sa</description>
    </items>
    <items>
      <name>Se</name>
      <description>Se</description>
    </items>
    <items>
      <name>Shi</name>
      <description>Shi</description>
    </items>
    <items>
      <name>So</name>
      <description>So</description>
    </items>
    <items>
      <name>Su</name>
      <description>Su</description>
    </items>
    <items>
      <name>Ta</name>
      <description>Ta</description>
    </items>
    <items>
      <name>Te</name>
      <description>Te</description>
    </items>
    <items>
      <name>To</name>
      <description>To</description>
    </items>
    <items>
      <name>Tsu</name>
      <description>Tsu</description>
    </items>
    <items>
      <name>U</name>
      <description>U</description>
    </items>
    <items>
      <name>Wa</name>
      <description>Wa</description>
    </items>
    <items>
      <name>Wo</name>
      <description>Wo</description>
    </items>
    <items>
      <name>Ya</name>
      <description>Ya</description>
    </items>
    <items>
      <name>Yo</name>
      <description>Yo</description>
    </items>
    <items>
      <name>Yu</name>
      <description>Yu</description>
    </items>
    <items>
      <name>Za</name>
      <description>Za</description>
    </items>
    <items>
      <name>Ze</name>
      <description>Ze</description>
    </items>
    <items>
      <name>Zo</name>
      <description>Zo</description>
    </items>
    <items>
      <name>Zu</name>
      <description>Zu</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеНаРусском</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Юникод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮникодПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКатакана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоМиниСимвол</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Словарь/src/DataProcessors/ЗаполнениеАзбук/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьКатакану(Команда)
	ЗаполнитьКатакануНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьХирагану(Команда)
	ЗаполнитьХирагануНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьКатакануНаСервере()
	Набор = РегистрыСведений.Катакана.СоздатьНаборЗаписей();
	Набор.Записать();
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаАзбука();
	Запрос.УстановитьПараметр("ЭтоКатакана", Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.Катакана.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Записать();	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьХирагануНаСервере()
	Набор = РегистрыСведений.Хирагана.СоздатьНаборЗаписей();
	Набор.Записать();
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаАзбука();
	Запрос.УстановитьПараметр("ЭтоКатакана", Ложь);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.Хирагана.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Записать();	
	КонецЦикла;
	
КонецПроцедуры

// Возвращает текст запроса для получения данных из справочника Моджи с учетом фильтра по катакане
//
// Возвращаемое значение:
//   Строка - Текст запроса
&НаСервере
Функция ТекстЗапросаАзбука()
	БазовыйТекст =
	"ВЫБРАТЬ
	|	Моджи.Ссылка КАК Моджи,
	|	Моджи.Наименование КАК Наименование,
	|	Моджи.НаименованиеНаРусском КАК НаименованиеНаРусском,
	|	Моджи.Юникод КАК Юникод,
	|	Моджи.ЮникодПредставление КАК ЮникодПредставление
	|ИЗ
	|	Справочник.Моджи КАК Моджи
	|ГДЕ
	|	Моджи.ЭтоКатакана = &ЭтоКатакана
	|	И Моджи.ПометкаУдаления = ЛОЖЬ
	|	И Моджи.ЭтоМиниСимвол = ЛОЖЬ";
	
	Если ВключатьМиниСимволы Тогда
		Возврат СтрЗаменить(БазовыйТекст, "И Моджи.ЭтоМиниСимвол = ЛОЖЬ", "");
	Иначе
		Возврат БазовыйТекст;
	КонецЕсли;
	
КонецФункции
#КонецОбласти
